{
    "weapon": {
        "Buff_Dkatana_IceDMG_Add_des": "Increase frost damage by ???% for ??? seconds.",
        "Buff_Dkatana_IceDMG_Add_name": "Frost Damage Boost",
        "Buff_Dkatana_Ice_Resonance_des": "Frost Resonance: Increase frost ATK by ???% and frost resistance by ???%. Activate by equipping 2 or more frost weapons. This set effect works in the off-hand slot.",
        "Buff_Dkatana_Ice_Resonance_name": "Frost Resonance",
        "Buff_Dkatana_SSR_Level0_des": "Frost Resonance: Increase frost ATK by ???% and frost resistance by ???%. Activate by equipping 2 or more frost weapons. This set effect works in the off-hand slot.",
        "Buff_Dkatana_SSR_Level0_des_OS": "Frost Resonance: Increase frost ATK by ???% and frost resistance by ???%. Activate by equipping 2 or more frost weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
        "Buff_Dkatana_SSR_Level1_des": "When Frost Resonance is activated, all weapon skill cooldowns are cleared every 5 times weapon skills are used, and the damage of Flow and Counterattack is increased by 1 time for the next ??? seconds.",
        "Buff_Dkatana_SSR_Level3_des": "Excited Flow: Increase the damage of Sword Shadow: Surge to 900% of frost ATK.\r\nSilent Flow: The cooldown of Sword Shadow: Surge becomes ??? seconds.",
        "Buff_Dkatana_SSR_Level3_des_OS": "Excited Flow: Increase the damage of Sword Shadow: Surge to 350% of frost ATK.\r\nSilent Flow: The cooldown of Sword Shadow: Surge becomes ??? seconds.",
        "Buff_Dkatana_SSR_Level5_des": "Freeze time and trigger Phantasia upon Surge hitting the target. Share cooldown with the Phantasia triggered by dodging.",
        "Buff_Dkatana_SSR_Level6_des": "Upon hitting a target with Surge, increase frost damage by ???% for ??? seconds.\r\nUpon triggering block with Sword Shadow, reduce the frost damage dealt by enemy targets by ???% for ??? seconds.",
        "Dkatana_ice_ssr": "Heartstream",
        "Dkatana_ice_ssr_1": "A special tachi that adapts to the Super Flow experiments. It is able to sense the user's mental state and generate Sword Shadows to assist in combat at the right time.",
        "GA_FPlayerDkatanaChangeSkill_Success_des": "When weapon charge is full or Phantasia is triggered, remove all debuffs from the wielder and dash toward the target with a combo attack upon switching to this weapon, dealing damage equal to ???% of ATK + ???.",
        "GA_FPlayerDkatanaChangeSkill_Success_name": "Heartlotus",
        "GA_FPlayerDkatanaEvade_BackAttack_des": "Tap normal attack during the short period after dodging.\r\nThrow out 5 frost flying blades, each dealing damage equal to ???% of ATK + ???.",
        "GA_FPlayerDkatanaEvade_BackAttack_name": "Snowfall",
        "GA_FPlayerDkatanaEvade_ForwardAttack_des": "Tap normal attack during the short period after dodging.\r\nDash and spin to attack the target, dealing damage equal to ???% of ATK + ???.",
        "GA_FPlayerDkatanaEvade_ForwardAttack_name": "Polar Front",
        "GA_FPlayerDkatanaEvade_des": "Dodge right before being hit to trigger Phantasia, reducing the speed of enemies within the area. Become immune to hitstun for 0.5 seconds while dodging.",
        "GA_FPlayerDkatanaEvade_name": "Dodge",
        "GA_FPlayerDkatanaSkill_Skill1_des": "Dash toward the target and temporarily immobilize enemies along the path, dealing delayed damage up to ???% of ATK + ???. Cooldown: 30 seconds.",
        "GA_FPlayerDkatanaSkill_Skill1_name": "Excited Flow: Flashing Stream",
        "GA_FPlayerDkatanaSkill_Skill2_des": "Release the Silent Flow skills to enter a charge state for up to 3 seconds, continuously taunting nearby targets and absorbing damage up to 60% of the Max HP. At the end of the charge state, deal frost damage equal to 850% of frost ATK + 50% × damage absorbed to targets, and 20% of the unconsumed value is converted to HP recovery. Cooldown: 30 seconds.\r\n\r\nEnter the Silent Flow mode when Fortitude Resonance is activated. Excited Flow: Flashing Stream is replaced by Silent Flow: Concentrated Stream. Enter the Excited Flow when Fortitude Resonance is not activated.\r\nThe Wanderer can gain Sword Shadow which follows them around when using Saki Fuwa's skills. Sword Shadow will release Surge when the Wanderer uses Saki Fuwa's branch skills or discharge skills, dealing ranged damage equal to 450% of frost ATK. Cooldown of Surge: 10 seconds.\r\nIn the state of Excited Flow: Sword Shadow will release Flow when the Wanderer deals damage with any weapon, which inflicts damage equal to 125% of frost ATK on the first hit target and recovers HP equal to 57% of the damage. The maximum recovery each time does not exceed 100% of ATK. Cooldown: 0.8 seconds.\r\nIn the state of Silent Flow: After Sword Shadow releases Surge, the Wanderer obtains 3 blocks for 10 seconds, and the maximum block capacity does not exceed 15% of Max HP. Each successful block deals Counterattack damage equal to 450% of  frost ATK to the target, and the shatter of Surge increases by 100% with the taunt effect added.",
        "GA_FPlayerDkatanaSkill_Skill2_des_OS": "Cast the Silent Flow skills to begin charging for up to 3 seconds, continuously taunting nearby targets and absorbing damage up to 60% of Max HP. At the end of the charge, deal frost damage equal to 408% of frost ATK + 50% of absorbed damage to targets, and 20% of the unconsumed value is converted to HP recovery. Cooldown: 30 seconds.\r\n\r\nEnter Silent Flow when Fortitude Resonance is activated. Excited Flow: Flashing Stream is replaced by Silent Flow: Concentrated Stream. Enter Excited Flow when Fortitude Resonance is not activated.\r\nThe Wanderer can gain Sword Shadow, which follows them around when using Saki Fuwa's skills. Sword Shadow will release Surge when the Wanderer uses Saki Fuwa's branch skills or discharge skills, dealing ranged damage equal to 175% of frost ATK. Cooldown of Surge: 10 seconds.\r\nWhile in Excited Flow: Sword Shadow will release Flow when the Wanderer deals damage with any weapon, which inflicts damage equal to 45% of frost ATK on the first hit target and recovers HP equal to 57% of the damage. The maximum recovery each time cannot exceed 100% of ATK. Cooldown: 0.8 seconds.\r\nWhile in Silent Flow: After Sword Shadow releases Surge, the Wanderer obtains 3 blocks for 10 seconds, and the maximum block capacity cannot exceed 15% of Max HP. Each successful block deals Counterattack damage equal to 225% of frost ATK to the target, and the shatter of Surge increases by 100% with an added taunt effect.",
        "GA_FPlayerDkatanaSkill_Skill2_name": "Silent Flow: Concentrated Stream",
        "GA_PlayerDkatanaMelee_AirAttack_des": "While airborne or after jumping once, use normal attack to attack 5 times in a row in mid-air.\r\nFirst Attack: Deal damage equal to ???% of ATK + ???.\r\nSecond Attack: Deal damage equal to ???% of ATK + ???.\r\nThird Attack: Deal damage equal to ???% of ATK + ???.\r\nFourth Attack: Deal damage equal to ???% of ATK + ???.\r\nFifth Attack: Deal damage equal to ???% of ATK + ???.",
        "GA_PlayerDkatanaMelee_AirAttack_name": "Airsplit",
        "GA_PlayerDkatanaMelee_Branch1_des": "In the Excited Flow mode, tap and hold normal attack to trigger the skill.\r\nDash forward with a swirling multi-attack, dealing a maximum of ???% of ATK + ??? damage.",
        "GA_PlayerDkatanaMelee_Branch1_name": "Excited Flow: Vortex",
        "GA_PlayerDkatanaMelee_Branch2_des": "In the Silent Flow mode, hold normal attack immediately or while launching normal attacks to trigger the skill.\r\nHold the attack button to keep the Anticipation. Release the button to deal ???% of ATK + ??? damage. When hit during the attacking period, blocks 20% of your max HP.",
        "GA_PlayerDkatanaMelee_Branch2_name": "Silent Flow: Barrier",
        "GA_PlayerDkatanaMelee_JumpAttack_des": "Tap and hold normal attack while airborne, or use normal attack while climbing, jumping backward, or using the Jetpack to trigger.\r\nWhile falling, deal damage equal to ???% of ATK + ??? each hit. Upon landing, deal damage equal to ???% of ATK + ??? to nearby targets.",
        "GA_PlayerDkatanaMelee_JumpAttack_name": "Frostfall",
        "GA_PlayerDkatanaMelee_Melee_des": "Launch 5 Heartstream attacks while on the ground.\r\nThe first attack deals ???% of ATK + ??? damage to the target and knocks the target back a short distance.\r\nThe second attack deals ???% of ATK + ??? damage to the target and knocks the target back a short distance.\r\nThe third attack deals ???% of ATK + ??? damage to the target and knocks the target back a short distance.\r\nThe fourth attack deals ???% of ATK + ??? damage to the target and knocks the target back a short distance.\r\nThe fifth attack deals ???% of ATK + ??? damage to the target and launches the target into the air.",
        "GA_PlayerDkatanaMelee_Melee_name": "Ragestream"
    },
    "matrix": {}
}