{
    "Buff_Tianlang_SSR_Level0_OS_des": "Volt Resonance: Increase volt ATK by 15% and volt resistance by 25%. Activate by equipping 2 or more volt weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "Buff_Tianlang_Thunder_Resonance_des_OS": "Volt Resonance: Increase volt ATK by 15% and volt resistance by 25%. Activate by equipping 2 or more volt weapons. This set effect works in the off-hand slot. Cannot stack with effects of the same type.",
    "tianlangpugongbeidongdes_OS": "When wielding Thunderbreaker, every 4 normal attacks will charge the weapon, stacking up to 5 charge points. After charging, any Electromancy dodge skill triggers electrocution with lightning. Lightning damage dealt equals 3% of HP lost (but no lower than 100% of Volt ATK, and no higher than 1,000% of Volt ATK), and triggers Electrified Entity, which deals area volt damage equal to 2% of HP lost (no lower than 40% of Volt ATK, and no higher than 400% of Volt ATK).",
    "GA_FPlayerTianLangSkill_Skill_des_OS": "Unleash a barrage of attacks, dealing damage equal to ???% of ATK + ??? to enemies within range, and transform enemies and your summons within a certain range into Electrified Entities. Up to 3 Electrified Entities can exist at a time. Cooldown: 30 seconds.\r\n\r\nGain Volt Sense when Dubhe is used: Scan the other two equipped weapons when unleashing skills. Each additional volt weapon sensed by it increases volt ATK by 6% for 25 seconds.\r\n\r\nElectrified Entity: When unleashing any volt weapon skill or discharge, Electrified Entities unleash volt area damage equal to 5% of missing HP (no less than 100% of volt ATK, no more than 1,000% of volt ATK).\r\n\r\nWhen using Thunderbreaker, unleashing any volt weapon skill or discharge skill consumes 30% of current HP to deal additional volt damage equal to 45% of the consumed HP (no less than 400% volt ATK, no more than 3,000% volt ATK) and gains temporary invincibility (unavailable in Apex League). 8 seconds later or when HP is lower than 10%, recover 5% of missing HP every second for 8 seconds (not affected by any healing effects). The recovery effect is not stackable.",
    "GA_FPlayerTianLangChangeSkill_Success_des_OS": "When weapon charge is full or Phantasia is triggered, switching to this weapon from another weapon removes all debuffs from the wielder. Thunderbreaker unleashes wide-range volt damage, dealing damage equal to ???% of ATK + ??? and transforms enemies and your summons within a certain range into Electrified Entities. Up to 3 Electrified Entities can exist at a time.\r\n\r\nElectrified Entity: When unleashing any volt weapon skill or discharge skill, Electrified Entities unleash volt area damage equal to 5% of missing HP (no less than 100% volt ATK, no more than 1,000% volt ATK).\r\n\r\nWhen using Thunderbreaker, unleashing any volt weapon skill or discharge consumes 30% of current HP to deal additional volt damage equal to 45% of the consumed HP (no less than 400% of volt ATK and no more than 3,000% of volt ATK) and gain temporary invincibility (unavailable in Apex League). After 8 seconds or when HP is lower than 10%, recover 5% missing HP every second for 8 seconds (not affected by healing effects). The recovery effect is not stackable.",
    "Buff_Tianlang_Thunder_Resonance_OS_name": "Volt Resonance"
}